Repository: TarasPanchenko/release-notes-openSUSE
Catalog: po/*.po
Languages: ca, it, pl

# _
source: translator-credits
ca: Equip de traducció d'openSUSE al català: opensusecatala@gmail.com
it: Responsabili traduzione: Andrea Florio <andrea@opensuse.org>, 2007,2011 Andrea Turrini <andrea.turrini@gmail.com> 2011,2014 Alessio Adamo <alessio.adamo@gmail.com> 2016-2018 Ringraziamenti particolari a: * Andrea Turrini <andrea.turrini@gmail.com>, 2008,2014 * Giacomo Barazzetti, 2011,2013 * Eugenio Mastroviti <genia@genia.net>, 2011 * Giuseppe Bevacqua <gepeppe@gmail.com>, 2008 * Luca Giusti <addictedtox@hotmail.it>, 2008 * Ezio Tonetto <murdock2000@email.it>, 2008 * Roberta Di Mitri <robynica@hotmail.com>, 2008 * Craig Jeffare ed i traduttori della Novell * Monica Badia ed i traduttori della SUN * Alessio Dessi * Clara Tattoni * Marco Ciampa * tutti i revisori del TP * Ettore Perazzoli, perso, ma mai dimenticato * Alberto Passalacqua <alberto.passalacqua@tin.it>, 2005,2007 * Luca Ferretti <elle.uca@infinito.it>
pl: tłumacz-kredyty

source: Release Notes
ca: Notes de la versió
it: Note di rilascio
pl: Informacje o wydaniu

source: @VERSION@
ca: @VERSIÓ@

source: openSUSE Tumbleweed is a free and Linux-based operating system for your PC, laptop or server. You can surf the web, manage your e-mails and photos, do office work, play videos or music and have a lot of fun!
ca: L'openSUSE Tumbleweed és un sistema operatiu lliure basat en Linux per al vostre ordinador de sobretaula, portàtil o servidor. Podeu usar-lo per navegar, gestionar el correu, les fotografies, fer feina d'oficina, reproduir vídeos o música i passar-vos-ho molt bé!
it: openSUSE Tumbleweed è un sistema operativo libero e gratuito basato su Linux adatto a PC, computer portatili o server. È possibile navigare in rete, gestire le proprie e-mail e fotografie, svolgere attività d'ufficio, guardare video, ascoltare musica e divertirsi!
pl: openSUSE Tumbleweed to darmowy i oparty na Linuksie system operacyjny dla Twojego komputera PC, laptopa lub serwera. Możesz surfować po Internecie, zarządzać wiadomościami e-mail i zdjęciami, wykonywać pracę biurową, odtwarzać filmy lub muzykę i dobrze się bawić!

source: The release notes are under constant development. To find out about the latest updates, see the online version at <link xlink:href="https://doc.opensuse.org/release-notes"/>. The English release notes are updated whenever need arises. Translated language versions can temporarily be incomplete.
ca: Les notes de la versió estan en desenvolupament constant. Per descobrir-ne les últimes actualitzacions, vegeu-ne la versió en línia a <link xlink:href="https://doc.opensuse.org/release-notes"/>. La versió en anglès s'actualitza sempre que cal. Les versions traduïdes poden ser temporalment incompletes.
it: Le note di rilascio sono in costante aggiornamento. Per scoprire di più sulle ultime novità, si faccia riferimento alla versione online su <link xlink:href="https://doc.opensuse.org/release-notes"/>. Le note di rilascio in inglese sono aggiornate in tempo reale. Le versioni tradotte potrebbero essere temporaneamente incomplete.
pl: Informacje o wydaniu są nieustannie aktualizowane. Aby sprawdzić najnowszą wersję, sprawdź <link xlink:href="https://doc.opensuse.org/release-notes"/>. Angielska wersja jest aktualizowana na bieżąco. Tłumaczenia natomiast mogą być tymczasowo nieaktualne.

source: To report bugs against this release, use the openSUSE Bugzilla. For more information, see <link xlink:href="https://en.opensuse.org/openSUSE:Submitting_bug_reports"/>.
ca: Per informar d'errors d'aquesta versió, useu el Bugzilla de l'openSUSE . Per a més informació, vegeu <link xlink:href="https://en.opensuse.org/openSUSE:Submitting_bug_reports"/>.
it: Per segnalare malfunzionamenti rispetto a questo rilascio, usare Bugzilla di openSUSE. Per maggiori informazioni si veda <link xlink:href="https://it.opensuse.org/openSUSE:Segnalazione_bug"/>.
pl: Aby zgłosić błędy w tym wydaniu, użyj openSUSE Bugzilla. Aby uzyskać więcej informacji, zobacz <link xlink:href="https://en.opensuse.org/openSUSE:Submitting_bug_reports"/>.

source: Installation
ca: Instal·lació
it: Installazione
pl: Instalacja

source: UEFI—Unified Extensible Firmware Interface
ca: UEFI: Interfície de Microprogramari Extensible Unificat
pl: UEFI — zunifikowany, rozszerzalny interfejs oprogramowania układowego

source: Prior to installing openSUSE on a system that boots using UEFI (Unified Extensible Firmware Interface), you are urgently advised to check for any firmware updates the hardware vendor recommends and, if available, to install such an update. A pre-installed Windows 8 is a strong indication that your system boots using UEFI.
ca: Abans d'instal·lar l'openSUSE en un sistema que arrenqui amb UEFI (Unified Extensible Firmware Interface), us suggerim emfàticament que comproveu qualsevol actualització del microprogramari que pugui recomanar-ne el fabricant i, si està disponible, que la instal·leu. Si teniu Windows 8 preinstal·lat és una sòlida indicació que el sistema arrencarà amb UEFI.
it: Prima di installare openSUSE su un sistema che si avvia usando UEFI (Unified Extensible Firmware Interface), si verifichi urgentemente se esiste un aggiornamento del firwmare raccomandato dal fornitore dell'hardware e, se disponibile, lo si installi. Un sistema Windows 8 pre-installato indica che quasi sicuramente il sistema si avvia usando UEFI.
pl: Przed zainstalowaniem openSUSE w systemie, który uruchamia się za pomocą UEFI (Unified Extensible Firmware Interface), pilnie zaleca się sprawdzenie wszelkich aktualizacji oprogramowania sprzętowego zalecanych przez dostawcę sprzętu i, jeśli są dostępne, zainstalowanie takiej aktualizacji. Preinstalowany system Windows 8 wyraźnie wskazuje, że system uruchamia się przy użyciu UEFI.

source: <emphasis>Background:</emphasis> Some UEFI firmware has bugs that cause it to break if too much data gets written to the UEFI storage area. Nobody really knows how much "too much" is, though. openSUSE minimizes the risk by not writing more than the bare minimum required to boot the OS. The minimum means telling the UEFI firmware about the location of the openSUSE boot loader. Upstream Linux Kernel features that use the UEFI storage area for storing boot and crash information (<literal>pstore</literal>) have been disabled by default. Nevertheless, it is recommended to install any firmware updates the hardware vendor recommends.
ca: <emphasis>Context:</emphasis> Algun microprogramari UEFI té errors que causen fallades si s'escriuen massa dades a l'àrea d'emmagatzematge UEFI. Ningú no sap què significa exactament quant és 'massa'. L'openSUSE minimitza el risc no escrivint més que el mínim necessari per arrencar el sistema. El mínim significa dir al microprogramari UEFI la localització del carregador d'arrencada de l'openSUSE. Les característiques de la font original del nucli de Linux que usen l'àrea UEFI per desar informació d'arrencada i de fallades (<literal>pstore</literal>) han estat inhabilitades per defecte. Tot i això, és recomanable instal·lar qualsevol actualització del microprogramari UEFI que el fabricant recomani.
it: <emphasis>Informazioni di base:</emphasis> alcuni firmware UEFI presentano dei bug che ne causano la rottura quando si scrivono troppi dati nell'area di memorizzazione UEFI. Nessuno conosce di preciso quanto siano questi "troppi dati", comunque. openSUSE minimizza il rischio non scrivendo alcun dato eccedente il minimo richiesto per avviare il sistema operativo. Il minimo significa dire al firmware UEFI la locazione del boot loader di openSUSE. Le funzionalità del kernel Linux upstream di usare l'area di memorizzazione UEFI per memorizzare le informazioni di avvio e crash (<literal>pstore</literal>) sono state disabilitate in modo predefinito. Comunque sia si raccomanda di installare ogni aggiornamento firmware raccomandato dal fornitore dell'hardware.
pl: <emphasis>Tło:</emphasis> Niektóre oprogramowanie układowe UEFI ma błędy, które powodują jego awarię, jeśli w obszarze pamięci UEFI zostanie zapisana zbyt duża ilość danych. Nikt tak naprawdę nie wie, ile to „za dużo”. openSUSE minimalizuje ryzyko, nie pisząc więcej niż minimum wymagane do uruchomienia systemu operacyjnego. Minimum oznacza poinformowanie oprogramowania układowego UEFI o lokalizacji programu ładującego openSUSE. Funkcje jądra Linuksa, które wykorzystują obszar pamięci UEFI do przechowywania informacji o rozruchu i awariach (<literal>pstore</literal>), zostały domyślnie wyłączone. Niemniej jednak zaleca się zainstalowanie wszelkich aktualizacji oprogramowania sprzętowego zalecanych przez dostawcę sprzętu.

source: UEFI, GPT, and MS-DOS Partitions
ca: UEFI, GPT i particions MS-DOS
it: UEFI, GPT e partizioni MS-DOS
pl: Partycje UEFI, GPT oraz MS-DOS

source: Together with the EFI/UEFI specification, a new style of partitioning arrived: GPT (GUID Partition Table). This new schema uses globally unique identifiers (128-bit values displayed in 32 hexadecimal digits) to identify devices and partition types.
ca: Amb la implementació d'EFI/UEFI, va arribar un nou estil de partició: GPT (GUID Partition Table). Aquest nou esquema usa identificadors globalment únics (valors de 128 bits mostrats en 32 dígits hexadecimals) per identificar dispositius i tipus de particions.
it: Assieme alla specifica EFI/UEFI è arrivato un nuovo stile di partizionamento: GPT (Tabella delle Partizioni GUID). Questo nuovo schema usa identificatori univoci globali (valori a 128 bit rappresentati con 32 caratteri esadecimali) per identificare dispositivi e tipi di partizione.
pl: Wraz ze specyfikacją EFI/UEFI pojawił się nowy styl partycjonowania: GPT (Tabela partycji GUID). Ten nowy schemat używa globalnie unikatowych identyfikatorów (wartości 128-bitowe wyświetlane w 32 cyfrach szesnastkowych) do identyfikacji urządzeń i typów partycji.

source: Additionally, the UEFI specification also allows legacy MBR (MS-DOS) partitions. The Linux boot loaders (ELILO or GRUB2) try to automatically generate a GUID for those legacy partitions, and write them to the firmware. Such a GUID can change frequently, causing a rewrite in the firmware. A rewrite consist of two different operation: removing the old entry and creating a new entry that replaces the first one.
ca: Addicionalment, l'especificació UEFI també permet particions de llegat MBR (MS-DOS). Els carregadors d'arrencada de Linux (ELILO or GRUB2) intenten generar automàticament un GUID per a aquestes particions de llegat i escriure-les al microprogramari. Aquest GUID pot canviar freqüentment i causar-ne una reescriptura. Aquesta reescriptura consisteix en dues operacions diferents: suprimir l'entrada antiga i crear-ne una que reemplaci la primera.
it: La specifica UEFI permette inoltre le partizioni obsolete MBR (MS-DOS). I boot loader Linux (ELILO o GRUB2) cercano di generare automaticamente un GUID per tali partizioni obsolete e di scriverle nel firmware. Tale GUID può cambiare frequentemente causando la riscrittura nel firmware. Una riscrittura è composta da due operazioni diverse: rimozione della vecchia voce e creazione di una nuova voce che sostituisce la prima.
pl: Dodatkowo, w specyfikacji UEFI partycje MRB (MS-DOS) są kompatybilne wstecz. Program rozruchowy LINUX (ELILO lub GRUB2) próbuje automatycznie wygenerować GUID dla tych partycji i zapisuje je w firmwarze. Takie GUID mogą się często zmieniać, wywołując nadpisanie w firmwarze. Na nadpisanie składają się dwie operacje: Usunięcie starego wpisu oraz stworzenie nowego który zastępuje pierwszy.

source: Modern firmware has a garbage collector that collects deleted entries and frees the memory reserved for old entries. A problem arises when faulty firmware does not collect and free those entries; this may end up with a non-bootable system.
ca: El microprogramari modern té un recol·lector de porqueria que recull entrades esborrades i allibera la memòria reservada per a entrades antigues. Hi ha un problema quan un microprogramari és defectuós i no ho fa, això pot arribar a suposar un sistema que no arrenqui.
it: Il firmware moderno possiede un garbage collector che raccoglie le voci cancellate e libera la memoria riservata per le vecchie voci. Sorge un problema quando il firmware erroneo non raccoglie e libera tali voci: può portare ad un sistema non avviabile.
pl: Nowoczesny firmware posiada kolektor śmieci który zbiera usunięte wpisy i uwalnia pamięć zarezerwowaną dla starego wpisu.Problem powstaje gdy wadliwy firmware nie zbiera oraz uwalnia tych wpisów. Może to doprowadzić do problemów z uruchomieniem systemu.

source: The workaround is simple: convert the legacy MBR partition to the new GPT to avoid this problem completely.
ca: La solució provisional és simple: convertir la partició de llegat MBR a la nova GPT per evitar aquest problema completament.
it: La soluzione è semplice: convertire le partizioni MBR obsolete nelle nuove GPT per prevenire completamente tale problema.
pl: W celu ominięcia problemu, przekształć stare partycje MRB na GPT.

source: System with LUKS-Encrypted Partition Does Not Boot
ca: El sistema amb una partició encriptada amb LUKS no arrenca
it: I sistemi con partizione cifrata tramite LUKS non si avviano
pl: System z zaszyfrowaną partycją LUKS nie uruchamia się

source: In some cases, Plymouth does not display the passphrase prompt properly. To fix this, add <literal>plymouth.enable=0</literal> to the kernel command line. See also <link xlink:href="https://bugzilla.opensuse.org/show_bug.cgi?id=966255"/>.
ca: En alguns casos, el Plymouth no mostra la demanda de la contrasenya correctament. Per corregir-ho, afegiu <literal>plymouth.enable=0</literal> a la línia d'ordres del nucli. Vegeu també l'enllaç <link xlink:href="https://bugzilla.opensuse.org/show_bug.cgi?id=966255"/>.
it: In alcuni casi, Plymouth non mostra correttamente la richiesta d'immissione della frase d'accesso. Per risolvere il problema, aggiungere <literal>plymouth.enable=0</literal> alla linea di comando del kernel. Si veda anche <link xlink:href="https://bugzilla.opensuse.org/show_bug.cgi?id=966255"/>.
pl: W niektórych przypadkach, Plymouth nie wyświetla poprawnie okienka do wpisywania hasła. Aby to naprawić dodaj <literal>plymouth.enable=0</literal> do wiersza poleceń jądra. Sprawdź również <link xlink:href="https://bugzilla.opensuse.org/show_bug.cgi?id=966255"/>.

source: <command>systemctl stop apparmor</command> Does Not Work
ca: L'ordre <command>systemctl stop apparmor</command> no funciona.
it: <command>systemctl stop apparmor</command> non funziona più
pl: <command>systemctl stop apparmor</command> nie działa

source: In the past, there could be confusion over the difference between how the very similarly named <command>systemctl</command> subcommands <literal>reload</literal> and <literal>restart</literal> worked for AppArmor:
ca: Anteriorment, hi podia haver confusions pel que fa a la diferència entre el funcionament de les subordres de <command>systemctl</command>, anomenades de manera molt semblant, <literal>reload</literal> i <literal>restart</literal> per a l'AppArmor:
it: In passato poteva essere fatta confusione sui diversi effetti che i sottocomandi con nomi molto simili <literal>reload</literal> e <literal>restart</literal> di <command>systemctl</command> avevano su AppArmor:
pl: W przeszłości, powstawało zamieszanie co do różnic pomiędzy podobnie brzmiącymi pod-komendami polecenia <command> systemctl</command>, <literal>reload</literal> oraz <literal>restart</literal>, które działały dla AppArmor:

source: <command>systemctl reload apparmor</command> properly reloaded all AppArmor profiles. (It was and continues to be the recommended way of reloading AppArmor profiles.)
ca: L'ordre <command>systemctl reload apparmor</command> recarregava adequadament tots els perfils d'AppArmor. (Era i continua sent el mètode recomanat per tornar a carregar els perfils d'AppArmor.)
it: <command>systemctl reload apparmor</command> ricaricava correttamente tutti i profili AppArmor. (Era e continua ad essere la modalità raccomandata di ricaricare i profili AppArmor.)
pl: Opcja <command>systemctl reload apparmor</command> przeładowywała profile AppArmor. (To była i jest rekomendowana metoda do przeładowywania profili AppArmor.)

source: <command>systemctl restart apparmor</command> meant that AppArmor would stop, thereby unloading all AppArmor profiles and then restart which left all existing processes unconfined. Only newly started processes would then be confined again.
ca: L'ordre <command>systemctl restart apparmor</command> significava que l'AppArmor s'aturava i, per tant, es descarregava de tots els perfils d'AppArmor, i després es reiniciava, acció que deixava tots els processos existents sense confinar. Només els processos iniciats com a nous es tornaven a confinar.
it: <command>systemctl restart apparmor</command> implicava invece che AppArmor si sarebbe arrestato, cancellando dalla memoria tutti i profili, e poi si sarebbe riavviato, il che lasciava tutti i processi non confinati. Solo i processi avviati da lì in avanti sarebbero stati confinati di nuovo.
pl: Opcja <command>systemctl restart apparmor</command> oznaczała zatrzymanie AppArmor, przez co profile AppArmor były rozładowane pozostawiając aktualnie działające procesy nie pokryte po restarcie. Jedynie nowe procesy były pokrywane.

source: Unfortunately, <systemitem>systemd</systemitem> does not provide a solution within its unit file format for the issue posed by the <literal>restart</literal> scenario.
ca: Per desgràcia, <systemitem>systemd</systemitem> no proporciona una solució dins del format de fitxer d'unitat per a la situació que comporta l'ordre de <literal>restart</literal>.
it: Sfortunatamente, <systemitem>systemd</systemitem>, nell'ambito del proprio formato di file di unità, non fornisce una soluzione al problema posto dallo scenario <literal>restart</literal>.
pl: Niestety, <systemitem>systemd</systemitem> nie zapewnia rozwiązania problemu w swoim formacie plików jednostkowych dla scenariusza przedstawionego w scenariuszu <literal>restart</literal>.

source: Starting with AppArmor 2.12, the command <command>systemctl stop apparmor</command> will not work. As a consequence, <command>systemctl restart apparmor</command> will now correctly reload AppArmor profiles.
ca: Començant amb l'AppArmor 2.12, l'ordre <command>systemctl stop apparmor</command> no funcionarà. Com a conseqüència, <command>systemctl restart apparmor</command> ara tornarà a carregar correctament els perfils d'AppArmor.
it: A partire da AppArmor 2.12, il comando <command>systemctl stop apparmor</command> non funziona più. Di conseguenza, ora <command>systemctl restart apparmor</command> ricarica correttamente i profili AppArmor.
pl: Zaczynając od wersji 2.12 AppArmor, polecenie <command>systemctl stop apparmor</command> nie będzie działało. W konsekwencji <command>systemctl restart apparmor</command> będzie poprawnie przeładowywać profile AppArmor.

source: To unload all AppArmor profiles, use the new command <command>aa-teardown</command> instead which matches the previous behavior of <command>systemctl stop apparmor</command>.
ca: Per descarregar tots els perfils d'AppArmor, useu l'ordre nova <command>aa-teardown</command>, que coincideix amb el comportament anterior de <command>systemctl stop apparmor</command>.
it: Per cancellare dalla memoria tutti i profili AppArmor, usare invece il nuovo comando <command>aa-teardown</command>, che si comporta come un tempo faceva <command>systemctl stop apparmor</command>.
pl: Do rozładowania wszystkich profili AppArmor, użyj polecenia <command>aa-teardown</command>, które odpowiada zachowaniem usunientemu poleceniu <command>systemctl stop apparmor</command>.

source: For more information, see <link xlink:href="https://bugzilla.opensuse.org/show_bug.cgi?id=996520"/> and <link xlink:href="https://bugzilla.opensuse.org/show_bug.cgi?id=853019"/>.
ca: Per a més informació, vegeu <link xlink:href="https://bugzilla.opensuse.org/show_bug.cgi?id=996520"/> i <link xlink:href="https://bugzilla.opensuse.org/show_bug.cgi?id=853019"/>.
it: Per i dettagli, fare riferimento a <link xlink:href="https://bugzilla.opensuse.org/show_bug.cgi?id=996520"/> e <link xlink:href="https://bugzilla.opensuse.org/show_bug.cgi?id=853019"/>.
pl: Aby uzyskać więcej informacji, zobacz <link xlink:href="https://bugzilla.opensuse.org/show_bug.cgi?id=996520"/> i <link xlink:href="https://bugzilla.opensuse.org/ show_bug.cgi?id=853019"/>.

source: No Default Compose Key Combination
ca: Cap combinació de tecles per defecte
it: Nessuna combinazione predefinita per il tasto Compose
pl: Brak domyślnej kombinacji klawiszy tworzenia

source: In previous versions of openSUSE, the compose key combination allowed typing characters that were not part of the regular keyboard layout. For example, to produce <quote>å</quote>, you could press and release <keycombo><keycap function="shift"/><keycap>Right Ctrl</keycap></keycombo> and then press <keycap>a</keycap> twice.
ca: En versions anteriors de l'openSUSE, les combinacions de tecles d'escriptura permetien escriure caràcters que no formaven part de la disposició regular del teclat. Per exemple, per produir <quote>å</quote>, es podien prémer i deixar anar <keycombo><keycap function="shift"/><keycap>Ctrl dret</keycap></keycombo> i després prémer dos cops <keycap>a</keycap>.
it: Nelle versioni precedenti di openSUSE, la combinazione per il tasto Compose consentiva la digitazione di caratteri non presenti sulla tastiera. Per esempio, per produrre <quote>å</quote>, era possibile premere e rilasciare <keycombo><keycap function="shift"/><keycap>Ctrl destro</keycap></keycombo> e successivamente premere due volte <keycap>a</keycap>.
pl: W poprzednich wersjach openSUSE kombinacja klawiszy tworzenia umożliwiała wpisywanie znaków, które nie były częścią zwykłego układu klawiatury. Na przykład, aby utworzyć <quote>å</quote>, możesz nacisnąć i zwolnić <keycombo><keycap function="shift"/><keycap>Prawy Ctrl</keycap></keycombo>, a następnie nacisnąć <keycap> a</keycap> dwa razy.

source: In openSUSE Tumbleweed, there is no longer a predefined compose key combination because <keycombo><keycap function="shift"/><keycap>Right Ctrl</keycap></keycombo> does not work as expected anymore.
ca: A l'openSUSE Tumbleweed, ja no hi ha cap combinació de tecles d'escriptura predeterminada perquè <keycombo><keycap function="shift"/><keycap>Ctrl dret</keycap></keycombo> ja no funciona com s'espera.
it: In openSUSE Tumbleweed, non esiste più una combinazione predefinita per il tasto Compose perché <keycombo><keycap function="shift"/><keycap>Ctrl destro</keycap></keycombo> non funziona più come previsto.
pl: W openSUSE Tumbleweed nie ma już pierwotnie zdefiniowanej kombinacji dla klawisza kompozycji, ponieważ <keycombo><keycap function="shift"/><keycap>Right Ctrl</keycap></keycombo> nie działa już w spodziewany sposób.

source: To define a system-wide custom compose key combination, use the file <filename>/etc/X11/Xmodmap</filename> and look for the following lines:
ca: Per definir una combinació de tecles per a tot el sistema, useu el fitxer <filename>/etc/X11/Xmodmap</filename> i cerqueu les línies següents:
it: Per definire una combinazione per il tasto Compose valida a livello di sistema, usare il file <filename>/etc/X11/Xmodmap</filename> e cercare le righe seguenti:
pl: Aby zdefiniować własną kombinację dla klawisza kompozycji, działającą w całym systemie, otwórz plik <filename>/etc/X11/Xmodmap</filename> i spójrz na następujące linie:
