Repository: TarasPanchenko/release-notes-openSUSE
Catalog: po/*.po
Languages: ca, it, pl

source: To uncomment the example code, remove the <literal>!</literal> characters at the beginning of lines. However, note that the setup from <filename>Xmodmap</filename> will be overwritten if you are using <command>setxkbmap</command>.
ca: Per desmarcar el codi d'exemple, suprimiu els caràcters <literal>!</literal> de l'inici de les línies. Ara bé, tingueu en compte que la configuració de <filename>Xmodmap</filename> se sobreescriurà si useu <command>setxkbmap</command>.
it: Per decommentare il codice d'esempio, rimuovere i <literal>!</literal> a inizio riga. Tuttavia, si noti che la configurazione tramite <filename>Xmodmap</filename> sarà sovrascritta se si utilizza <command>setxkbmap</command>.
pl: Żeby odkomentować przykładowy kod, usuń znaki <literal>!</literal> na początku linii. Pamiętaj, że ustawienia z <filename>Xmodmap</filename> będą nadpisane, jeżeli używasz <command>setxkbmap</command>.

source: To define a user-specific compose key combination, use your desktop's keyboard configuration tool or the command-line tool <command>setxkbmap</command>:
ca: Per definir una combinació de tecles d'escriptura específica per a l'usuari, useu l'eina de configuració del teclat de l'escriptori o l'eina de línia d'ordres <command>setxkbmap</command>:
it: Per definire una combinazione utente-specifica per il tasto Compose, utilizzare lo strumento di configurazione della tastiera del proprio ambiente desktop oppure lo strumento da riga di comando <command>setxkbmap</command>:
pl: Aby zdefiniować kombinację klawiszy kompozycji dla użytkownika, użyj narzędzia konfiguracji klawiatury albo narzędzia wiersza poleceń <command>setxkbmap</command>:

source: setxkbmap <replaceable>[...]</replaceable> -option compose:<replaceable>COMPOSE_KEY</replaceable>
ca: setxkbmap <replaceable>[...]</replaceable> -option compose:<replaceable>CLAU</replaceable>
pl: setxkbmap <replaceable>[...]</replaceable> -option skomponuj:<replaceable>COMPOSE_KEY</replaceable>

source: For the variable <replaceable>COMPOSE_KEY</replaceable>, use your preferred character, for example <literal>ralt</literal>, <literal>lwin</literal>, <literal>rwin</literal>, <literal>menu</literal>, <literal>rctl</literal>, or <literal>caps</literal>.
ca: Per a la variable <replaceable>TECLADECOMPOSICIÓ</replaceable>, useu el caràcter que preferiu, per exemple: <literal>ralt</literal>, <literal>lwin</literal>, <literal>rwin</literal>, <literal>menú</literal>, <literal>rctl</literal>, o <literal>maj.</literal>.
it: Per la variabile <replaceable>TASTO_COMPOSE</replaceable>, usare il carattere di propria preferenza, per esempio <literal>ralt</literal>, <literal>lwin</literal>, <literal>rwin</literal>, <literal>menu</literal>, <literal>rctl</literal> o <literal>caps</literal>.
pl: Dla zmiennej <replaceable>COMPOSE_KEY</replaceable> użyj preferowanego znaku, na przykład <literal >ralt</literal >, <literal >lwin</literal >, <literal >rwin</literal >, <literal >menu </literal >, <literal >rctl</literal > lub <literal >capitals</literal >.

source: Alternatively, use an IBus input method that allows typing the characters you need without a Compose key.
ca: Alternativament, useu un mètode d'entrada IBus que permeti escriure els caràcters que necessiteu sense una tecla de composició.
it: In alternativa, utilizzare un metodo di inserimento IBus che consente la digitazione dei caratteri di cui si ha bisogno senza un tasto Compose.
pl: Alternatywnie użyj metody wprowadzania IBus, która umożliwia wpisywanie potrzebnych znaków bez klawisza Compose.

source: More Information and Feedback
ca: Més informació i informació de retorn
it: Maggiori informazioni e feedback
pl: Więcej informacji oraz komentarze

source: Read the <filename>README</filename> documents on the medium.
ca: Llegiu els documents <filename>README</filename> del mitjà.
it: Si invita a leggere i documenti <filename>README</filename> presenti sul supporto di installazione.
pl: Przeczytaj dokumenty <filename>README</filename> na nośniku.

source: View a detailed changelog information about a particular package from its RPM:
ca: Visualitzeu informació detallada del registre de canvis d'un paquet concret respecte del seu RPM:
it: Per ottenere informazioni dettagliate sulle modifiche relative ad un particolare pacchetto dal suo RPM:
pl: Zobacz szczegółowe informacje z dziennika zmian dotyczące konkretnego pakietu z jego RPM:

source: rpm --changelog -qp <replaceable>FILENAME</replaceable>.rpm
ca: rpm --changelog -qp <replaceable>NOMDELFITXER</replaceable>.rpm
it: rpm --changelog -qp <replaceable>NOME_FILE</replaceable>.rpm
pl: rpm --changelog -qp <replaceable>NAZWA PLIKU</replaceable>.rpm

source: Replace <replaceable>FILENAME</replaceable> with the name of the RPM.
ca: Reemplaceu <replaceable>NOMDELFITXER</replaceable> amb el nom de l'RPM.
it: Sostituire <replaceable>NOME_FILE</replaceable> con il nome dell'RPM.
pl: Zastąp <replaceable>FILENAME</replaceable> nazwą RPM.

source: Check the <filename>ChangeLog</filename> file in the top level of the medium for a chronological log of all changes made to the updated packages.
ca: Comproveu el fitxer <filename>ChangeLog</filename> del primer nivell del mitjà per veure el registre cronològic de tots els canvis fets als paquets actualitzats.
it: Si controlli il file <filename>ChangeLog</filename> presente nella directory principale del supporto per un log cronologico di tutte le modifiche fatte ai pacchetti aggiornati.
pl: Sprawdź plik <filename>ChangeLog</filename> na najwyższym poziomie nośnika, aby znaleźć chronologiczny dziennik wszystkich zmian dokonanych w zaktualizowanych pakietach.

source: Find more information in the <filename>docu</filename> directory on the medium.
ca: Trobeu més informació dins del directori <filename>docu</filename> del mitjà.
it: Maggiori informazioni sono disponibili nella directory <filename>docu</filename> del supporto.
pl: Znajdź więcej informacji w katalogu <filename>docu</filename> na nośniku.

source: For additional or updated documentation, see <link xlink:href="https://doc.opensuse.org/"/>.
ca: Per a informació addicional o documentació actualitzada, vegeu <link xlink:href="https://doc.opensuse.org/"/>.
it: Per documentazione aggiuntiva o aggiornata, si veda <link xlink:href="https://doc.opensuse.org/"/>.
pl: Aby uzyskać dodatkową lub zaktualizowaną dokumentację, zobacz <link xlink:href="https://doc.opensuse.org/"/>.

source: For the latest product news, from openSUSE, visit <link xlink:href="https://www.opensuse.org"/>.
ca: Per a les últimes notícies de productes d'openSUSE, vegeu <link xlink:href="https://www.opensuse.org"/>.
it: Per le ultime novità sui prodotti di openSUSE, si veda <link xlink:href="https://www.opensuse.org"/>.
pl: Aby uzyskać najnowsze informacje o produkcie, openSUSE, odwiedź <link xlink:href="https://www.opensuse.org"/>.

source: Copyright © SUSE LLC
ca: Dret de còpia © SUSE LLC

source: Thanks for using openSUSE.
ca: Gràcies per usar openSUSE.
it: Grazie per usare openSUSE.
pl: Dziękujemy za korzystanie z openSUSE.

source: The openSUSE Team.
ca: L'equip d'openSUSE i l'equip de traducció al català: opensusecatala@gmail.com.
it: Il team openSUSE.
pl: Zespół openSUSE.

source: General
it: Generale
pl: Informacje ogólne

source: [...] !! Third example: Change right Control key to Compose key. !! To do Compose Character, press this key and afterwards two !! characters (e.g. `a' and `^' to get 342). !remove Control = Control_R !keysym Control_R = Multi_key !add Control = Control_R [...]
pl: [...] !! Trzeci przykład: Zmień prawy control na klawisz kompozycji !! Aby wstawić Znak Kompozycji, naciśnij ten klawisz i później dwa !! znaki (np. `a' i `^' aby otrzymać 342). !remove Control = Control_R !keysym Control_R = Multi_key !add Control = Control_R [...]
